Invalid selection there cannot be any open connectors for the design to fabrication part tool.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId InvalidSelectionThereCannotBeOpenConnectors { get; }
  Visual Basic
Public Shared ReadOnly Property InvalidSelectionThereCannotBeOpenConnectors As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InvalidSelectionThereCannotBeOpenConnectors {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace